tap "heroku/brew"
tap "homebrew/bundle"
tap "null-dev/firefox-profile-switcher"
tap "supabase/tap"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# X.Org: Interface to the X Window System protocol
brew "libxcb"
# Vector graphics library with cross-device output support
brew "cairo"
# Dependency manager for Cocoa projects
brew "cocoapods"
# General-purpose scripting language
brew "php"
# Dependency Manager for PHP
brew "composer"
# Secure runtime for JavaScript and TypeScript
brew "deno"
# .NET Core
brew "dotnet"
# Command-line fuzzy finder written in Go
brew "fzf"
# Distributed revision control system
brew "git"
# OpenType text shaping engine
brew "harfbuzz"
# Open-source build automation tool based on the Groovy and Kotlin DSL
brew "gradle"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Simple terminal UI for git commands
brew "lazygit"
# C library for files containing sampled sound
brew "libsndfile"
# Powerful, lightweight programming language
brew "lua"
# Java-based project management
brew "maven"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Platform built on V8 to build network applications
brew "node"
# Libraries for security-enabled client and server applications
brew "nss"
# SSL/TLS VPN implementing OSI layer 2 or 3 secure network extension
brew "openvpn"
# Fast, disk space efficient package manager
brew "pnpm"
# Cross-platform library for audio I/O
brew "portaudio"
# Implementation of Telnet and SSH
brew "putty"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Safe, concurrent, practical language
brew "rust"
# Organize software neatly under a single directory tree (e.g. /usr/local)
brew "stow"
# Terminal multiplexer
brew "tmux"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# HTTP benchmarking tool
brew "wrk"
# JavaScript package manager
brew "yarn"
# The native component of the Profile Switcher for Firefox extension.
brew "null-dev/firefox-profile-switcher/firefox-profile-switcher-connector"
# Supabase CLI
brew "supabase/tap/supabase"
# Utility to hide menu bar items
cask "hiddenbar"
